// Строгий режим
"use strict"

// Задача №1
// Що потрапить в консоль?

let someVar = 0;
++someVar;

if (someVar) {
	console.log(someVar);
}

// Розв'язання:
// У консоль потрапить: 1.

// Задача №2
// За допомогою циклу FOR виведіть в консоль 10 рядків:
// Пункт №1
// Пункт №2
// і т.д.

// Розв'язання:
for (let i = 1; i <= 10; ++i) {
	console.log(`Пункт № ${i}`)
}

// Задача №3
// Що потрапить в консоль ?
if (2 * 20 <= 10 || 30 / 2 < 5 && 10 <= "10" || 20 === "20") {
	console.log('000');
}

// Розв'язання:
// Крок №1:
// if (false || false && false || false) {
// 	console.log('000');
// }

// Крок №2:
// if (false || false || false) {
// 	console.log('000');
// }
// Крок №3:
// if (false || false) {
// 	console.log('000');
// }
// Крок №4
// if (false) {
// 	console.log('000');
// }

// Вивід в консоль не відбудеться так як false.

// Задача №4
// Створіть функцію, яка повертає результат ділення числа a на число b з додаванням рядка "Результат ділення: "
// Викличте функцію передаючі різні значення, у тому числі не передаючи зовсім.
// Функція не має повертати NaN, Infinite або помилку.

// Роз'вязання:
function someFunction(a, b) {
	let result = a / b;
	if (typeof a !== 'number' || typeof b !== 'number') {
		return "Вхідні дані не числа";
	} else if (b === 0) {
		return "Ділити на нуль не можна!";
	} else if (isNaN(result) || !isFinite(result)) {
		return 0;
	} else {
		return result;
	}
}
console.log(`"Результат ділення:${someFunction(30, 5)}`);
console.log(`"Результат ділення:${someFunction("30", "5")}`);
console.log(`"Результат ділення:${someFunction("30", 5)}`);
console.log(`"Результат ділення:${someFunction(30, 0)}`);
console.log(`"Результат ділення:${someFunction(-1, 0)}`)
console.log(`"Результат ділення:${someFunction()}`)

// Задача №5
// Створіть масив даних - 5 елементів, один з яких число 10
// Обробіть масив за допомогою методу перебору
// Перевіряйте елемент на відповідність числу 10, та у разі відповідності, виводьте в консоль

// Роз'вязання:

let someArr = [4, "Іван", 10, "Кава", "5"];
someArr.forEach((value, index) => {
	if (value === 10) {
		console.log(`Елемент під індексом ${index} відповідає числу 10`);
	}
})

